In [1]:
import pandas as pd

data = pd.read_csv("Data/data.csv")

print(data)

     Name   Age   City
0   Ayush  21.0  Surat
1     Joy   NaN    NaN
2    Prem  55.0  Surat
3   Abhay  45.0    NaN
4  Piyush   NaN    NaN

In [2]:
data.isnull()

    Name    Age   City
0  False  False  False
1  False   True   True
2  False  False  False
3  False  False   True
4  False   True   True

In [3]:
data.isnull().sum()

Name    0
Age     2
City    3
dtype: int64

In [4]:
data.dropna()

    Name   Age   City
0  Ayush  21.0  Surat
2   Prem  55.0  Surat

In [5]:
data["Age"].fillna(data["Age"].mean(), inplace = True)

C:\Users\Suryakant\AppData\Local\Temp\ipykernel_8332\1419251285.py:1: ChainedAssignmentError: A value is being set on a copy of a DataFrame or Series through chained assignment using an inplace method.
Such inplace method never works to update the original DataFrame or Series, because the intermediate object on which we are setting values always behaves as a copy (due to Copy-on-Write).

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' instead, to perform the operation inplace on the original object, or try to avoid an inplace operation using 'df[col] = df[col].method(value)'.

See the documentation for a more detailed explanation: https://pandas.pydata.org/pandas-docs/stable/user_guide/copy_on_write.html
  data["Age"].fillna(data["Age"].mean(), inplace = True)

0    21.000000
1    40.333333
2    55.000000
3    45.000000
4    40.333333
Name: Age, dtype: float64

In [6]:
print(data)

     Name   Age   City
0   Ayush  21.0  Surat
1     Joy   NaN    NaN
2    Prem  55.0  Surat
3   Abhay  45.0    NaN
4  Piyush   NaN    NaN

In [2]:
print(data.isnull().mean() * 100)

NameError: name 'data' is not defined